const electronic = [
  "맥북에어",
  "윈도우",
  "맥북프로",
  "맥프로",
  "맥미니",
  "맥스튜디오",
  "아이맥",
  "한성컴퓨터",
  "한성노트북",
  "아이폰",
  "아이폰13미니",
  "아이폰14",
  "아이폰14프로",
  "아이폰13",
  "아이폰12",
  "아이폰12미니",
  "아이폰Xs",
  "아이폰X",
  "아이폰8",
  "아이폰7",
  "아이폰6s",
  "아이폰6",
  "아이폰5",
  "아이폰4",
  "삼성노트북",
  "아이패드",
  "삼성갤럭시Z플립1",
  "삼성갤럭시Z플립2",
  "삼성갤럭시Z플립3",
  "삼성갤럭시Z플립4",
  "삼성S",
  "삼성S2",
  "삼성S3",
  "삼성S4",
  "삼성S5",
  "삼성S6",
  "삼성S7",
  "삼성S8",
  "삼성S9",
  "삼성S10",
  "삼성S21",
  "삼성S22",
  "삼성S20",
  "삼성Note",
  "삼성Note2",
  "삼성Note3",
  "삼성Note4",
  "삼성Note5",
  "삼성Note6",
  "삼성Note7",
  "삼성Note8",
  "삼성Note10",
  "삼성Note20",
  "에어팟",
  "에어팟2",
  "에어팟3",
  "에어팟프로",
  "에어팟프로2",
  "인텔",
  "라이젠",
];
// (Modi + F)로 이미 있는 단어인지 확인 하고 만드셈들
// 물론 중복 제거 기능이 있긴 한데 CPU 사용하니까 ;;
// 띄어쓰기 X
// 맞춤법 체크 하셈
// 느금마 같은거 넣지 마셈

let gx = electronic.filter((v) => v.indexOf(" ") == -1);
let gxy = gx.filter((element, index) => {
  return gx.indexOf(element) === index;
});

exports.default = gxy;
